{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "b279580c",
   "metadata": {},
   "source": [
    "Web server interface at https://xxxx:7473 Update - since the videos were filmed, neo4j requires a longer, more complex password, so the newest password is here: Username: neo4j\n",
    "\n",
    "Password: ucb_mids_w205\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d11591dc",
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "from IPython.display import display"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "7d4146ca",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = neo4j.GraphDatabase.driver(uri=\"neo4j://neo4j:7687\", auth=(\"neo4j\",\"ucb_mids_w205\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "376ec061",
   "metadata": {},
   "outputs": [],
   "source": [
    "session = driver.session(database=\"neo4j\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "27bfbc38",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_wipe_out_database():\n",
    "    \"wipe out database by deleting all nodes and relationships\"\n",
    "    \n",
    "    query = \"match (node)-[relationship]->() delete node, relationship\"\n",
    "    session.run(query)\n",
    "    \n",
    "    query = \"match (node) delete node\"\n",
    "    session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "68a1e7a1",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_run_query_pandas(query, **kwargs):\n",
    "    \"run a query and return the results in a pandas dataframe\"\n",
    "    \n",
    "    result = session.run(query, **kwargs)\n",
    "    \n",
    "    df = pd.DataFrame([r.values() for r in result], columns=result.keys())\n",
    "    \n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "c9a3c6d1",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_nodes_relationships():\n",
    "    \"print all the nodes and relationships\"\n",
    "   \n",
    "    print(\"-------------------------\")\n",
    "    print(\"  Nodes:\")\n",
    "    print(\"-------------------------\")\n",
    "    \n",
    "    query = \"\"\"\n",
    "        match (n) \n",
    "        return n.name as node_name, labels(n) as labels\n",
    "        order by n.name\n",
    "    \"\"\"\n",
    "    \n",
    "    df = my_neo4j_run_query_pandas(query)\n",
    "    \n",
    "    number_nodes = df.shape[0]\n",
    "    \n",
    "    display(df)\n",
    "    \n",
    "    print(\"-------------------------\")\n",
    "    print(\"  Relationships:\")\n",
    "    print(\"-------------------------\")\n",
    "    \n",
    "    query = \"\"\"\n",
    "        match (n1)-[r]->(n2) \n",
    "        return n1.name as node_name_1, labels(n1) as node_1_labels, \n",
    "            type(r) as relationship_type, n2.name as node_name_2, labels(n2) as node_2_labels\n",
    "        order by node_name_1, node_name_2\n",
    "    \"\"\"\n",
    "    \n",
    "    df = my_neo4j_run_query_pandas(query)\n",
    "    \n",
    "    number_relationships = df.shape[0]\n",
    "    \n",
    "    display(df)\n",
    "    \n",
    "    density = (2 * number_relationships) / (number_nodes * (number_nodes - 1))\n",
    "    \n",
    "    print(\"-------------------------\")\n",
    "    print(\"  Density:\", f'{density:.1f}')\n",
    "    print(\"-------------------------\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b3307825",
   "metadata": {},
   "source": [
    "# Minimum Spanning Tree"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "22e2f64e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7fed096d6be0>"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "my_neo4j_wipe_out_database()\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cor.csv' AS row\n",
    "MERGE (a:Stock {name: row.stock_a})\n",
    "MERGE (b:Stock {name: row.stock_b})\n",
    "MERGE (a)-[:LINK {weight: toFloat(row[\"0\"])}]->(b)\n",
    "MERGE (b)-[s:LINK {weight: toFloat(row[\"0\"])}]->(a)\n",
    "\"\"\"\n",
    "\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "06d9444a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes:\n",
      "-------------------------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node_name</th>\n",
       "      <th>labels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AAL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AAP</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>AAPL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ABBV</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>425</th>\n",
       "      <td>XYL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>426</th>\n",
       "      <td>YUM</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>427</th>\n",
       "      <td>ZBH</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>428</th>\n",
       "      <td>ZION</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>429</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>430 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    node_name   labels\n",
       "0           A  [Stock]\n",
       "1         AAL  [Stock]\n",
       "2         AAP  [Stock]\n",
       "3        AAPL  [Stock]\n",
       "4        ABBV  [Stock]\n",
       "..        ...      ...\n",
       "425       XYL  [Stock]\n",
       "426       YUM  [Stock]\n",
       "427       ZBH  [Stock]\n",
       "428      ZION  [Stock]\n",
       "429       ZTS  [Stock]\n",
       "\n",
       "[430 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Relationships:\n",
      "-------------------------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node_name_1</th>\n",
       "      <th>node_1_labels</th>\n",
       "      <th>relationship_type</th>\n",
       "      <th>node_name_2</th>\n",
       "      <th>node_2_labels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>AAL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>AAP</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>AAPL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>ABBV</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>ABT</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>184465</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>XRX</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>184466</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>XYL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>184467</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>YUM</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>184468</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>ZBH</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>184469</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>ZION</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>184470 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       node_name_1 node_1_labels relationship_type node_name_2 node_2_labels\n",
       "0                A       [Stock]              LINK         AAL       [Stock]\n",
       "1                A       [Stock]              LINK         AAP       [Stock]\n",
       "2                A       [Stock]              LINK        AAPL       [Stock]\n",
       "3                A       [Stock]              LINK        ABBV       [Stock]\n",
       "4                A       [Stock]              LINK         ABT       [Stock]\n",
       "...            ...           ...               ...         ...           ...\n",
       "184465         ZTS       [Stock]              LINK         XRX       [Stock]\n",
       "184466         ZTS       [Stock]              LINK         XYL       [Stock]\n",
       "184467         ZTS       [Stock]              LINK         YUM       [Stock]\n",
       "184468         ZTS       [Stock]              LINK         ZBH       [Stock]\n",
       "184469         ZTS       [Stock]              LINK        ZION       [Stock]\n",
       "\n",
       "[184470 rows x 5 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Density: 2.0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "my_neo4j_nodes_relationships()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "011e1973",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7fed0f06eee0>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('graph', false)\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "CALL gds.graph.project(\n",
    "  'graph', \n",
    "  'Stock',   \n",
    "  {\n",
    "    LINK: {\n",
    "        properties: 'weight',\n",
    "        orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  }\n",
    ")\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "3e13c37b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>preProcessingMillis</th>\n",
       "      <th>computeMillis</th>\n",
       "      <th>writeMillis</th>\n",
       "      <th>effectiveNodeCount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>81</td>\n",
       "      <td>81</td>\n",
       "      <td>430</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   preProcessingMillis  computeMillis  writeMillis  effectiveNodeCount\n",
       "0                    1             81           81                 430"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (n:Stock {name: $source})\n",
    "CALL gds.spanningTree.write('graph', {\n",
    "  sourceNode: n,\n",
    "  relationshipWeightProperty: 'weight',\n",
    "  writeProperty: 'writeCost',\n",
    "  writeRelationshipType: 'MINST'\n",
    "})\n",
    "YIELD preProcessingMillis, computeMillis, writeMillis, effectiveNodeCount\n",
    "RETURN preProcessingMillis, computeMillis, writeMillis, effectiveNodeCount;\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"AAPL\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "5f22bac2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>destination</th>\n",
       "      <th>cost</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>AAPL</td>\n",
       "      <td>CHK</td>\n",
       "      <td>-0.777350</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>CHK</td>\n",
       "      <td>BA</td>\n",
       "      <td>-0.721650</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>CHK</td>\n",
       "      <td>RHI</td>\n",
       "      <td>-0.698809</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>CHK</td>\n",
       "      <td>GT</td>\n",
       "      <td>-0.625741</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>CHK</td>\n",
       "      <td>AKAM</td>\n",
       "      <td>-0.796752</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>424</th>\n",
       "      <td>XOM</td>\n",
       "      <td>ADBE</td>\n",
       "      <td>-0.779078</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>425</th>\n",
       "      <td>ADBE</td>\n",
       "      <td>CF</td>\n",
       "      <td>-0.719713</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>426</th>\n",
       "      <td>ADBE</td>\n",
       "      <td>COP</td>\n",
       "      <td>-0.610530</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>427</th>\n",
       "      <td>ADBE</td>\n",
       "      <td>MO</td>\n",
       "      <td>-0.447406</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>428</th>\n",
       "      <td>ADBE</td>\n",
       "      <td>OXY</td>\n",
       "      <td>-0.726798</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>429 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    source destination      cost\n",
       "0     AAPL         CHK -0.777350\n",
       "1      CHK          BA -0.721650\n",
       "2      CHK         RHI -0.698809\n",
       "3      CHK          GT -0.625741\n",
       "4      CHK        AKAM -0.796752\n",
       "..     ...         ...       ...\n",
       "424    XOM        ADBE -0.779078\n",
       "425   ADBE          CF -0.719713\n",
       "426   ADBE         COP -0.610530\n",
       "427   ADBE          MO -0.447406\n",
       "428   ADBE         OXY -0.726798\n",
       "\n",
       "[429 rows x 3 columns]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "query = \"\"\"\n",
    "\n",
    "MATCH path = (n:Stock {name: $source})-[:MINST*]-()\n",
    "WITH relationships(path) AS rels\n",
    "UNWIND rels AS rel\n",
    "WITH DISTINCT rel AS rel\n",
    "RETURN startNode(rel).name AS source, endNode(rel).name AS destination, rel.writeCost AS cost\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"AAPL\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "51a88e08",
   "metadata": {},
   "source": [
    "#### Find the central nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "966cf38d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7fed0ef567c0>"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('graph2', false)\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('graph2', 'Stock', 'MINST', {relationshipProperties: 'writeCost'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "d2218597",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>degree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>AAPL</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AEE</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AON</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>BIIB</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>PG</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>PX</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>RRC</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>XEL</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ADBE</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>LEG</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>UNH</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>WMT</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>CSCO</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>HP</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>SBUX</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>UNM</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>BDX</td>\n",
       "      <td>6.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>PDCO</td>\n",
       "      <td>7.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>HAL</td>\n",
       "      <td>9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>CHK</td>\n",
       "      <td>10.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>EQT</td>\n",
       "      <td>11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>EXC</td>\n",
       "      <td>12.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>APA</td>\n",
       "      <td>20.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>CHTR</td>\n",
       "      <td>28.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>PFE</td>\n",
       "      <td>55.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>HUM</td>\n",
       "      <td>153.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    name  degree\n",
       "0   AAPL     3.0\n",
       "1    AEE     3.0\n",
       "2    AON     3.0\n",
       "3   BIIB     3.0\n",
       "4     PG     3.0\n",
       "5     PX     3.0\n",
       "6    RRC     3.0\n",
       "7    XEL     3.0\n",
       "8   ADBE     4.0\n",
       "9    LEG     4.0\n",
       "10   UNH     4.0\n",
       "11   WMT     4.0\n",
       "12  CSCO     5.0\n",
       "13    HP     5.0\n",
       "14  SBUX     5.0\n",
       "15   UNM     5.0\n",
       "16   BDX     6.0\n",
       "17  PDCO     7.0\n",
       "18   HAL     9.0\n",
       "19   CHK    10.0\n",
       "20   EQT    11.0\n",
       "21   EXC    12.0\n",
       "22   APA    20.0\n",
       "23  CHTR    28.0\n",
       "24   PFE    55.0\n",
       "25   HUM   153.0"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "CALL gds.degree.stream('graph2', { orientation: 'NATURAL' })\n",
    "YIELD nodeId, score\n",
    "WHERE score > 2\n",
    "RETURN gds.util.asNode(nodeId).name AS name, score as degree\n",
    "ORDER BY degree ASC, name\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df = my_neo4j_run_query_pandas(query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "66721985",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['AAPL', 'AEE', 'AON', 'BIIB', 'PG', 'PX', 'RRC', 'XEL', 'ADBE', 'LEG', 'UNH', 'WMT', 'CSCO', 'HP', 'SBUX', 'UNM', 'BDX', 'PDCO', 'HAL', 'CHK', 'EQT', 'EXC', 'APA', 'CHTR', 'PFE', 'HUM']\n"
     ]
    }
   ],
   "source": [
    "print(list(df.name))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2ef640fc",
   "metadata": {},
   "source": [
    "# LOUVAIN MODULARITY"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "164b24f4",
   "metadata": {},
   "source": [
    "#### For every node, delete all but the three highest correlation outgoing relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "c76484e2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7fed096c0190>"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (n:Stock)\n",
    "WITH n\n",
    "MATCH (n)-[r:LINK]->()\n",
    "WITH n, r, COUNT(*) AS totalLinks\n",
    "ORDER BY r.weight DESC\n",
    "WITH n, totalLinks, COLLECT(r) AS relationships\n",
    "WITH n, totalLinks, relationships[3..] AS relsToDelete\n",
    "UNWIND relsToDelete AS relToDelete\n",
    "DELETE relToDelete;\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "234edc78",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes:\n",
      "-------------------------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node_name</th>\n",
       "      <th>labels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AAL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AAP</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>AAPL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ABBV</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>425</th>\n",
       "      <td>XYL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>426</th>\n",
       "      <td>YUM</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>427</th>\n",
       "      <td>ZBH</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>428</th>\n",
       "      <td>ZION</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>429</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>430 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    node_name   labels\n",
       "0           A  [Stock]\n",
       "1         AAL  [Stock]\n",
       "2         AAP  [Stock]\n",
       "3        AAPL  [Stock]\n",
       "4        ABBV  [Stock]\n",
       "..        ...      ...\n",
       "425       XYL  [Stock]\n",
       "426       YUM  [Stock]\n",
       "427       ZBH  [Stock]\n",
       "428      ZION  [Stock]\n",
       "429       ZTS  [Stock]\n",
       "\n",
       "[430 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Relationships:\n",
      "-------------------------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node_name_1</th>\n",
       "      <th>node_1_labels</th>\n",
       "      <th>relationship_type</th>\n",
       "      <th>node_name_2</th>\n",
       "      <th>node_2_labels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>SHW</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>SRCL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>A</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>WAT</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>AAL</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>EFX</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>AAL</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>INTU</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1285</th>\n",
       "      <td>ZION</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>CMA</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1286</th>\n",
       "      <td>ZION</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>EXR</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1287</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>EXPD</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1288</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>EXR</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1289</th>\n",
       "      <td>ZTS</td>\n",
       "      <td>[Stock]</td>\n",
       "      <td>LINK</td>\n",
       "      <td>FL</td>\n",
       "      <td>[Stock]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1290 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     node_name_1 node_1_labels relationship_type node_name_2 node_2_labels\n",
       "0              A       [Stock]              LINK         SHW       [Stock]\n",
       "1              A       [Stock]              LINK        SRCL       [Stock]\n",
       "2              A       [Stock]              LINK         WAT       [Stock]\n",
       "3            AAL       [Stock]              LINK         EFX       [Stock]\n",
       "4            AAL       [Stock]              LINK        INTU       [Stock]\n",
       "...          ...           ...               ...         ...           ...\n",
       "1285        ZION       [Stock]              LINK         CMA       [Stock]\n",
       "1286        ZION       [Stock]              LINK         EXR       [Stock]\n",
       "1287         ZTS       [Stock]              LINK        EXPD       [Stock]\n",
       "1288         ZTS       [Stock]              LINK         EXR       [Stock]\n",
       "1289         ZTS       [Stock]              LINK          FL       [Stock]\n",
       "\n",
       "[1290 rows x 5 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Density: 0.0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "my_neo4j_nodes_relationships()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "995b4954",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7fed0adebf70>"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('graph', false)\"\n",
    "session.run(query)\n",
    "query = \"\"\"\n",
    "\n",
    "CALL gds.graph.project(\n",
    "  'graph',\n",
    "  'Stock',\n",
    "  'LINK'\n",
    ") \n",
    "YIELD *\n",
    "\n",
    "\"\"\"\n",
    "session.run(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "4f483834",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7fed0c034970>"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL gds.louvain.write('graph', {writeProperty: 'louvain'}) YIELD *\n",
    "\n",
    "\"\"\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ffeb3060",
   "metadata": {},
   "source": [
    "#### Color the nodes according to their community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "53cd27e7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7fed096d67c0>"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Stock)\n",
    "WITH DISTINCT toString(n.louvain) AS stockGroup, collect(DISTINCT n) AS stocks\n",
    "CALL apoc.create.addLabels(stocks, [apoc.text.upperCamelCase(stockGroup)]) YIELD node\n",
    "RETURN *\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "c5d77d72",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Stock</th>\n",
       "      <th>Community</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>AAP</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AIG</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AZO</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>CAT</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>CI</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>425</th>\n",
       "      <td>VFC</td>\n",
       "      <td>310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>426</th>\n",
       "      <td>XRAY</td>\n",
       "      <td>310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>427</th>\n",
       "      <td>NAVI</td>\n",
       "      <td>331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>428</th>\n",
       "      <td>PRGO</td>\n",
       "      <td>331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>429</th>\n",
       "      <td>WBA</td>\n",
       "      <td>331</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>430 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Stock  Community\n",
       "0     AAP         30\n",
       "1     AIG         30\n",
       "2     AZO         30\n",
       "3     CAT         30\n",
       "4      CI         30\n",
       "..    ...        ...\n",
       "425   VFC        310\n",
       "426  XRAY        310\n",
       "427  NAVI        331\n",
       "428  PRGO        331\n",
       "429   WBA        331\n",
       "\n",
       "[430 rows x 2 columns]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Stock)\n",
    "RETURN n.name as Stock, n.louvain as Community\n",
    "ORDER BY Community, Stock\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df = my_neo4j_run_query_pandas(query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "32c6f642",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "36     89\n",
       "249    71\n",
       "251    69\n",
       "30     55\n",
       "280    53\n",
       "310    33\n",
       "183    30\n",
       "44     27\n",
       "331     3\n",
       "Name: Community, dtype: int64"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.Community.value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "48c7e42d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>communityId</th>\n",
       "      <th>communitySize</th>\n",
       "      <th>Names</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>36</td>\n",
       "      <td>89</td>\n",
       "      <td>[MMM, AES, AFL, ARE, GOOGL, GOOG, AMT, ADI, AI...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>249</td>\n",
       "      <td>71</td>\n",
       "      <td>[AOS, A, ALK, AMP, AME, APH, AVY, BAC, COF, CN...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>251</td>\n",
       "      <td>69</td>\n",
       "      <td>[ABBV, AYI, AMD, ALL, AMZN, AXP, AON, AMAT, AJ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>30</td>\n",
       "      <td>55</td>\n",
       "      <td>[AAP, AIG, AZO, KMX, CAT, CI, CINF, STZ, CMI, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>280</td>\n",
       "      <td>53</td>\n",
       "      <td>[ABT, ACN, AMG, ALGN, ALLE, AAL, AMGN, ANSS, A...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>310</td>\n",
       "      <td>33</td>\n",
       "      <td>[ADBE, AKAM, LNT, AEP, AWK, AAPL, AVB, CNP, CM...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>183</td>\n",
       "      <td>30</td>\n",
       "      <td>[ALB, MO, APA, APTV, BDX, BWA, BMY, CF, CHK, C...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>44</td>\n",
       "      <td>27</td>\n",
       "      <td>[APD, AEE, ADM, BIIB, CHRW, CHTR, CMCSA, EQT, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>331</td>\n",
       "      <td>3</td>\n",
       "      <td>[NAVI, PRGO, WBA]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   communityId  communitySize  \\\n",
       "0           36             89   \n",
       "1          249             71   \n",
       "2          251             69   \n",
       "3           30             55   \n",
       "4          280             53   \n",
       "5          310             33   \n",
       "6          183             30   \n",
       "7           44             27   \n",
       "8          331              3   \n",
       "\n",
       "                                               Names  \n",
       "0  [MMM, AES, AFL, ARE, GOOGL, GOOG, AMT, ADI, AI...  \n",
       "1  [AOS, A, ALK, AMP, AME, APH, AVY, BAC, COF, CN...  \n",
       "2  [ABBV, AYI, AMD, ALL, AMZN, AXP, AON, AMAT, AJ...  \n",
       "3  [AAP, AIG, AZO, KMX, CAT, CI, CINF, STZ, CMI, ...  \n",
       "4  [ABT, ACN, AMG, ALGN, ALLE, AAL, AMGN, ANSS, A...  \n",
       "5  [ADBE, AKAM, LNT, AEP, AWK, AAPL, AVB, CNP, CM...  \n",
       "6  [ALB, MO, APA, APTV, BDX, BWA, BMY, CF, CHK, C...  \n",
       "7  [APD, AEE, ADM, BIIB, CHRW, CHTR, CMCSA, EQT, ...  \n",
       "8                                  [NAVI, PRGO, WBA]  "
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (n:Stock)\n",
    "RETURN n.louvain AS communityId,\n",
    "       count(*) AS communitySize,\n",
    "       collect(n.name) AS Names\n",
    "ORDER BY communitySize DESC\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8e59e556",
   "metadata": {},
   "source": [
    "# Low Degree Centrality Portfolio"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3423a424",
   "metadata": {},
   "source": [
    "### PageRank"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "21df1d4b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f7ab4858df0>"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false)\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Stock', 'LINK', {relationshipProperties: 'weight'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "42869b55",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>page_rank</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>AEP</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AFL</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AIV</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ALL</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>AMD</td>\n",
       "      <td>0.950000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>425</th>\n",
       "      <td>PNC</td>\n",
       "      <td>1.189511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>426</th>\n",
       "      <td>AMP</td>\n",
       "      <td>1.192319</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>427</th>\n",
       "      <td>APH</td>\n",
       "      <td>1.198010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>428</th>\n",
       "      <td>EFX</td>\n",
       "      <td>1.202183</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>429</th>\n",
       "      <td>IR</td>\n",
       "      <td>1.209403</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>430 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    name  page_rank\n",
       "0    AEP   0.950000\n",
       "1    AFL   0.950000\n",
       "2    AIV   0.950000\n",
       "3    ALL   0.950000\n",
       "4    AMD   0.950000\n",
       "..   ...        ...\n",
       "425  PNC   1.189511\n",
       "426  AMP   1.192319\n",
       "427  APH   1.198010\n",
       "428  EFX   1.202183\n",
       "429   IR   1.209403\n",
       "\n",
       "[430 rows x 2 columns]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "CALL gds.pageRank.stream('ds_graph',\n",
    "                         { maxIterations: $max_iterations,\n",
    "                           dampingFactor: $damping_factor}\n",
    "                         )\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).name AS name, score as page_rank\n",
    "ORDER BY page_rank ASC, name ASC\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "max_iterations = 20\n",
    "damping_factor = 0.05\n",
    "\n",
    "my_neo4j_run_query_pandas(query, max_iterations=max_iterations, damping_factor=damping_factor)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6c767ae7",
   "metadata": {},
   "source": [
    "### Incoming Degree Centrality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "97be1290",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7fed0f02ae80>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false)\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Stock', 'LINK', {relationshipProperties: 'weight'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "f535eeef",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>degree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>AEP</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AFL</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AIV</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ALL</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>AMD</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>425</th>\n",
       "      <td>AMP</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>426</th>\n",
       "      <td>APH</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>427</th>\n",
       "      <td>PNC</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>428</th>\n",
       "      <td>EFX</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>429</th>\n",
       "      <td>IR</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>430 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    name  degree\n",
       "0    AEP     0.0\n",
       "1    AFL     0.0\n",
       "2    AIV     0.0\n",
       "3    ALL     0.0\n",
       "4    AMD     0.0\n",
       "..   ...     ...\n",
       "425  AMP    14.0\n",
       "426  APH    14.0\n",
       "427  PNC    14.0\n",
       "428  EFX    15.0\n",
       "429   IR    15.0\n",
       "\n",
       "[430 rows x 2 columns]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "CALL gds.degree.stream('ds_graph', { orientation: 'REVERSE' })\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).name AS name, score as degree\n",
    "ORDER BY degree ASC, name\n",
    "\n",
    "\"\"\"\n",
    "df = my_neo4j_run_query_pandas(query)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b06943c6",
   "metadata": {},
   "source": [
    "##### Stocks that don't figure in the top three most correlated of other stocks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "c3ada84b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>degree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>AEP</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AFL</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AIV</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ALL</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>AMD</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>VFC</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>VRSK</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>WY</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>WYNN</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>YUM</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>71 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    name  degree\n",
       "0    AEP     0.0\n",
       "1    AFL     0.0\n",
       "2    AIV     0.0\n",
       "3    ALL     0.0\n",
       "4    AMD     0.0\n",
       "..   ...     ...\n",
       "66   VFC     0.0\n",
       "67  VRSK     0.0\n",
       "68    WY     0.0\n",
       "69  WYNN     0.0\n",
       "70   YUM     0.0\n",
       "\n",
       "[71 rows x 2 columns]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[df.degree==0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "baaa81fc",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
